content/redis.html


<p>
最近在研究redis。写redis的文章已经太多了，所以我就不继续写细节了。  
</p>
<p>
这篇文章主要是记一下自已看redis中觉得值得看的一些点。
</p>
<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">双hash表 </h3>
<div class="outline-text-3" id="text-1">

<p>rehash时为了不影响正常服务而提供<br/>
增量rehash
</p>


<pre class="example">计时   
while(rehash 100个)   
        计时，如果时间超了就break   
</pre>




</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">事件模型 </h3>
<div class="outline-text-3" id="text-2">

<p>异步单线程事件驱动。<br/>
优点是可以省掉线程切换的开销，缺点是没法充分利用多核硬件优势。<br/>
因此redis适合于并发量高但一次请求非常短的应用场景。
</p>
<p>
aeMain函数中<br/>
while(服务没停)<br/>
给机会执行事件处理之前的一些东西<br/>
事件处理aeProcessEvents<br/>
aeProcessEvents函数中调用aeApiPoll()<br/>
aeApiPoll函数中是调用操作系统的epoll,注意设置超时的，这样aeProcessEvents就可以返回
</p>
</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">支持多种数据结构 </h3>
<div class="outline-text-3" id="text-3">

<p>key-value中的value不仅可以是常规的string，也可以是一个链表，或哈希表<br/>
还支持集合，用skiplist实现的
</p>
</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">持久化 </h3>
<div class="outline-text-3" id="text-4">

<p>快照和aof方式  
</p>
<p>
aof方式实现：
</p><ol>
<li>
Redis通过fork一个子进程，遍历数据，写入新临时文件
</li>
<li>
父进程继续处理client请求，子进程继续写临时文件
</li>
<li>
父进程把新写入的aof写在缓冲区
</li>
<li>
子进程写完退出，父进程接到退出消息，将缓冲区aof写入临时文件
</li>
<li>
临时文件签名为appendonly.aof，原来文件被覆盖，整个过程完成
</li>
</ol>

<p>aof创建是指定的flags是open(filename, O_WRONLY|O_APPEND|O_CREATE, 0644)
</p>
<p>
redis对象的反序列化是通过从对象解析出命令实现的，反序列化成命令
</p>
<p>
主从

</p>
<hr/>
</div>
</div>
